nakagawa_6MPa/thermalPhaseChange/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    axis
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          1000;
        startFace       12975;
    }
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       13975;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       14000;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1000;
        startFace       14025;
    }
    front
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1000;
        startFace       15025;
    }
    back
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1000;
        startFace       16025;
    }
)

// ************************************************************************* //
